<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uses rtrouton's download recipe to fetch Logi OptionsPlus and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gahel.munki.LogitechOptionsPlus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Logi OptionsPlus</string>
        <key>MUNKI_CATEGORY</key>
        <string>Peripherals</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/logitech</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Logitech International S.A.</string>
            <key>description</key>
            <string>Logi OptionsPlus by Logitech</string>
            <key>display_name</key>
            <string>Logi OptionsPlus</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.LogiOptionsPlus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%found_filename%/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleVersion</key>
                    <string>version</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>ShellScriptProcessor</string>
            <key>Arguments</key>
            <dict>
                <key>script_path</key>
                <string>/usr/bin/productbuild</string>
                <key>script_contents</key>
                <string>#!/bin/bash
APP_PATH="%found_filename%"
PKG_PATH="%RECIPE_CACHE_DIR%/%NAME%.pkg"
/usr/bin/productbuild --component "$APP_PATH" /Applications --sign - "$PKG_PATH"
echo "$PKG_PATH"
</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
