<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Mockoon</string>
	<key>Identifier</key>
	<string>com.github.gahel.download.mockoon</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>mockoon</string>
        </dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>mockoon/mockoon</string>
				<key>asset_regex</key>
				<string>mockoon\.setup\.(?P&lt;version&gt;[0-9]+\.[0-9]+\.[0-9]+)\.arm64\.dmg</string>
			</dict>
		</dict>
  	        <dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key><string>AppDmgVersioner</string>
			key>Arguments</key>
		<dict>
			<key>dmg_path</key><string>%pathname%</string>
		</dict>
    </dict>
	</array>
</dict>
</plist>
