<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable Arduino.</string>
	<key>Identifier</key>
	<string>io.github.gahel.download.arduinoIDE</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Arduino IDE</string>
        <key>DOWNLOAD_PAGE</key>
        <string>https://www.arduino.cc/en/software</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;(https:)?\/\/(?:[^\/]*)arduino\.cc\/arduino-ide\/(?P&lt;filename&gt;\/?[^"']+macOS[^"']*\.(dmg|zip)))</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Arduino IDE.app</string>
                <key>requirement</key>
                <string>identifier "cc.arduino.Arduino" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* 
exists */ and certificate leaf[subject.OU] = "7KT7ZWMCJT"</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
