<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Arduino and imports into Munki.</string>
	<key>Identifier</key>
	<string>io.github.gahel.munki.arduinoIDE</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Arduino IDE</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
            <string>The open-source Arduino Software (IDE) makes it easy to write code and upload it to the board. It runs on Windows, Mac OS X, and Linux. The environment is written in Java and based 
on Processing and other open-source software. 
                
This software can be used with any Arduino board. 

Refer to the Getting Started page for Installation instructions:

https://www.arduino.cc/en/Guide/HomePage
            </string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>blocking_applications</key>
			<array>
				<string>%NAME%</string>
			</array>
                        <array>
                                <string>x86_64</string>
                        </array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.2</string>
    <key>ParentRecipe</key>
    <string>io.github.gahel.download.arduinoIDE</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
