<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Imports the Nextcloud package into Munki.</string>
      <key>Identifier</key>
      <string>com.github.gahel.munki.nextcloud</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Nextcloud-vfs</string>
         <key>MUNKI_REPO_SUBDIR</key>
         <string>utilities/nextcloud</string>
         <key>pkginfo</key>
         <dict>
            <key>catalogs</key>
            <array>
               <string>testing</string>
            </array>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
         </dict>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.gahel.pkg.nextcloud</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
               <key>repo_subdirectory</key>
               <string>%MUNKI_REPO_SUBDIR%</string>
               <key>pkginfo</key>
               <dict>
                  <key>display_name</key>
                  <string>%NAME%</string>
                  <key>name</key>
                  <string>%NAME%</string>
                  <key>category</key>
                  <string>Utilities</string>
                  <key>description</key>
                  <string>Nextcloud sync client.</string>
                  <key>developer</key>
                  <string>Nextcloud GmbH</string>
               </dict>
            </dict>
         </dict>
      </array>
   </dict>
</plist>

