<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of mreg-cli for macOS</string>
    <key>Identifier</key>
    <string>com.github.gahel.download.mreg-cli</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>nivlheim_client</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://api.github.com/repos/unioslo/nivlheim/releases/latest</string>
                <key>re_pattern</key>
                <string>zipball_url": "(.*)"</string>
                <key>result_output_var_name</key>
                <string>zipball_url</string>
                <key>request_headers</key>
                <dict>
                    <key>Accept</key>
                    <string>application/vnd.github+json</string>
                    <key>X-GitHub-Api-Version</key>
                    <string>2022-11-28</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%zipball_url%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>