<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the nivlheim download</string>
	<key>Identifier</key>
	<string>com.github.gahel.pkg.nivlheim_client</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>nivlheim_client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.gahel.download.nivlheim_client</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/scripts</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/nivlheim_client</string>
                <key>overwrite</key>
                <true/>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*/client/nivlheim_client</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_content</key>
                <string>
                    #!/bin/bash
                    /bin/chmod +x /usr/local/bin/nivlheim_client
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_content</key>
                <string>
                    #!/bin/bash
/bin/chmod +x /usr/local/bin/nivlheim_client
# Define file paths
CONFIG_FILE="/etc/nivlheim/client.yaml"
PLIST_FILE="/Library/LaunchDaemons/no.uio.usit.nivlheim.plist"

# Ensure the directories exist
sudo mkdir -p /etc/nivlheim

# Create client.yaml
sudo tee "$CONFIG_FILE" &gt; /dev/null &lt;&lt;EOL
files:
  - /etc/exports
  - /etc/fstab
  - /etc/group
  - /etc/hosts.allow
  - /etc/passwd
  - /etc/shadow
  - /etc/resolv.conf
  - /etc/ssh/ssh_host_dsa_key.pub
  - /etc/ssh/ssh_host_ecdsa_key.pub
  - /etc/ssh/ssh_host_rsa_key.pub
  - /etc/ssh/ssh_host_ed25519_key.pub
  - /etc/ssh_host_dsa_key.pub
  - /etc/ssh_host_rsa_key.pub
  - /etc/cups/printers.conf
  - /etc/sudoers
  - /etc/uio/info/classes.txt
  - /etc/uio/info/modules.txt
  - /etc/uio/info/web-applications.txt
  - /etc/uio/info/disk-escrow.tar
  - /etc/uio/conf/importance
  - /etc/uio/conf/location
  - /root/.ssh/authorized_keys
  - /var/root/.ssh/authorized_keys
  - /etc/uio/conf/primary-user
  - /etc/uio/conf/root-mail
  - /etc/uio/conf/site-admin
  - /etc/uio/info/filesystems.txt
  - /etc/uio/info/hardware-info.txt
  - /etc/uio/info/dmidecode.txt
  - /etc/uio/info/uname-info.txt
  - /etc/uio/info/pkg-packages.txt
  - /etc/uio/info/pkg-repolist.txt
  - /etc/uio/tmp/diskreport.txt
  - /etc/uio/flag/osx.noupgrade
  - /etc/uio/info/dsconfigad.txt
  - /Library/Managed Installs/ManagedInstallReport.plist
  - /Library/Managed Installs/ApplicationInventory.plist
  - /etc/zfs/exports
  - /var/run/dmesg.boot
commands:
  hourly:
    - cmd: /bin/ls -1 /etc/uio/flag
      timeout: 5
    - cmd: /usr/bin/uname -a
      timeout: 5
    - cmd: /bin/hostname -f
      timeout: 5
    - cmd: /usr/bin/sw_vers
      timeout: 5
    - cmd: /usr/bin/dscl . read /Groups/admin
      timeout: 5
    - cmd: /usr/bin/dscl . read /Groups/com.apple.access_ssh
      timeout: 5
    - cmd: /usr/bin/dscl . read /Groups/com.apple.access_screensharing
      timeout: 5 
    - cmd: /sbin/ifconfig
      timeout: 5
    - cmd: /usr/sbin/dsconfigad -show
      timeout: 5
    - cmd: /bin/df -h
      timeout: 5    
    - cmd: /usr/bin/lpstat -p
      timeout: 5
    - cmd: /usr/bin/lpstat -s
      timeout: 5
    - cmd: /usr/sbin/system_profiler SPHardwareDataType
      timeout: 5    
    - cmd: /usr/sbin/kextstat
      timeout: 5
    - cmd: /bin/ls -la /Applications
      timeout: 5
settings:
  server: nivlheim.uio.no
EOL

# Create plist file
sudo tee "$PLIST_FILE" &gt; /dev/null &lt;&lt;EOL
&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1.0"&gt;
&lt;dict&gt;
    &lt;key&gt;Label&lt;/key&gt;
    &lt;string&gt;no.uio.usit.nivlheim&lt;/string&gt;
    &lt;key&gt;ProgramArguments&lt;/key&gt;
    &lt;array&gt;
        &lt;string&gt;/usr/local/bin/nivlheim_client&lt;/string&gt;
    &lt;/array&gt;
    &lt;key&gt;StartInterval&lt;/key&gt;
    &lt;integer&gt;3600&lt;/integer&gt;
&lt;/dict&gt;
&lt;/plist&gt;
EOL

# Set permissions
sudo chown root:wheel "$CONFIG_FILE"
sudo chmod 644 "$CONFIG_FILE"
sudo chmod 755 /private/etc/ssl
sudo chmod 755 /private/etc/nivlheim
sudo chmod 755 /private/etc/ssl/certs
sudo chmod 444 /private/etc/ssl/certs/ca-bundle.crt
sudo chmod 755 /private/var/nivlheim
sudo chown root:wheel /private/etc/ssl/certs/ca-bundle.crt
sudo chown -R root:wheel /private/etc/nivlheim

# Load the plist file
sudo launchctl bootstrap system /Library/LaunchDaemons/no.uio.usit.nivlheim.plist

#sudo launchctl load "$PLIST_FILE" &gt; /dev/null 2&gt;&1

                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>no.uio.usit.nivlheim</string>
                    <key>version</key>
				    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
