<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of rclone for amd64 and arm64</string>
	<key>Identifier</key>
	<string>com.github.gahel.download.rclone_amd_arm</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>rclone_arm</string>
                <key>ARCH</key>
                <string>arm64</string>
        </dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>rclone/rclone</string>
				<key>asset_regex</key>
				<string>rclone-v[0-9\.]*-osx-%ARCH%.zip</string>
			</dict>
		</dict>
  	        <dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%ARCH%/</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
