<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the rclone download</string>
	<key>Identifier</key>
	<string>com.github.gahel.pkg.rclone_amd_arm</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>rclone</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.gahel.download.rclone_amd_arm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%ARCH%</string>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0775</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>0
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%_%ARCH%/rclone-*.*/%NAME%</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgname</key>
					<string>%NAME%-%ARCH%-%version%</string>
					<key>id</key>
					<string>github.ncw.rclone</string>
					<key>version</key>
					<string>%version%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>/usr/local/bin/rclone</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
