<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uses peshay's download recipe to fetch GlobalProtect and packages it for Intune upload.</string>
    <key>Identifier</key>
    <string>com.github.gahel.intune.GlobalProtect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GlobalProtect</string>
        <key>HOSTNAME</key>
        <string>vpn.example.com</string>
        <key>PLATFORM</key>
        <string>mac</string>
        <key>categories</key>
        <array>
            <string>Security</string>
        </array>
        <key>description</key>
        <string>GlobalProtect VPN Client from Palo Alto Networks</string>
        <key>developer</key>
        <string>Palo Alto Networks</string>
        <key>display_name</key>
        <string>GlobalProtect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.peshay.download.GlobalProtect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Distribution/gp.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%found_filename%/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/payload/Applications/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%found_filename%/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleVersion</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>BUNDLE_ID</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%found_filename%</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%pathname%</string>
                <key>bundleId</key>
                <string>%BUNDLE_ID%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>description</key>
                <string>%description%</string>
                <key>displayname</key>
                <string>%display_name%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
