<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uses peshay's download recipe to fetch GlobalProtect and packages it for Intune upload.</string>

    <key>Identifier</key>
    <string>com.github.gahel.intune.GlobalProtect</string>

    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GlobalProtect</string>
        <key>HOSTNAME</key>
        <string>vpn.example.com</string>
        <key>PLATFORM</key>
        <string>mac</string>
        <key>categories</key>
        <array>
            <string>Security</string>
        </array>
        <key>description</key>
        <string>GlobalProtect VPN Client from Palo Alto Networks</string>
        <key>developer</key>
        <string>Palo Alto Networks</string>
        <key>display_name</key>
        <string>GlobalProtect</string>
    </dict>

    <key>MinimumVersion</key>
    <string>0.6.1</string>

    <key>ParentRecipe</key>
    <string>com.github.peshay.download.GlobalProtect</string>

    <key>Process</key>
    <array>
        <!-- 1: Pakk ut flat pkg til %RECIPE_CACHE_DIR%/unpack -->
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>

        <!-- 2: Finn gp.pkg inne i unpack/ -->
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/gp.pkg</string>
            </dict>
        </dict>

        <!-- 3: Pakk ut payload fra gp.pkg til %RECIPE_CACHE_DIR%/payload -->
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%found_filename%/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>

        <!-- 4: Les Info.plist direkte fra payload/Contents/Info.plist -->
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleVersion</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>BUNDLE_ID</string>
                </dict>
            </dict>
        </dict>

        <!-- 5: Hent ikon fra app-bundlen i payload/ -->
        <dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
        </dict>

        <!-- 6: Last opp den originale PKG-en til Intune -->
        <dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
            <key>Arguments</key>
            <dict>
                <!-- PKG som peshay-recipen lastet ned -->
                <key>app_file</key>
                <string>%pathname%</string>

                <!-- Metadata hentet fra Info.plist -->
                <key>bundleId</key>
                <string>%BUNDLE_ID%</string>
                <key>bundleVersion</key>
                <string>%version%</string>

                <key>description</key>
                <string>%description%</string>
                <key>displayname</key>
                <string>%display_name%</string>

                <key>icon</key>
                <string>%icon_file_path%</string>

                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
