<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Downloads the latest version of mreg-cli for macOS</string>
        <key>Identifier</key>
        <string>com.github.gahel.download.mreg-cli</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>mreg-cli</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                        <key>Arguments</key>
                        <dict>
                                <key>github_repo</key>
                                <string>unioslo/mreg-cli</string>
                                <key>asset_regex</key>
        			<string>mreg-cli-macos-latest-[0-9\.]*</string>
        			<key>include_prereleases</key>
       				 <true/>
                        </dict>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                                <key>url</key>
                                <string>%url%</string>
                                <key>prefetch_filename</key>
                                <true/>
                                <key>filename</key>
                                <string>mreg-cli</string>
                        </dict>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                </dict>
        </array>
</dict>
</plist>
