<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads, packages and imports the current release version of mreg-cli</string>
	<key>Identifier</key>
	<string>com.github.gahel.munki.mreg-cli</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>mreg-cli</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities/mreg-cli</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<!--<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>-->
                        <key>unattended_install</key>
                        <true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.gahel.pkg.mreg-cli</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>display_name</key>
					<string>%NAME%</string>
					<key>name</key>
					<string>%NAME%</string>
					<key>category</key>
					<string>Utilities</string>
					<key>description</key>
					<string>mreg-cli is a command line interface for the MREG API.</string>
					<key>developer</key>
					<string>University of Oslo</string>
                    <key>unattended_install</key>
                    <true/>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
