<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the mreg-cli download</string>
	<key>Identifier</key>
	<string>com.github.gahel.pkg.x86.mreg-cli</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>mreg-cli</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.gahel.download.x86.mreg-cli</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
				<key>pkgdirs</key>
				<dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/build</string>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0775</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/bash

# Find the currently logged-in user
currentUser=$(scutil &lt;&lt;&lt; "show State:/Users/ConsoleUser" | awk '/Name :/ &amp;&amp; ! /loginwindow/ { print $3 }')

# Define the config file path for the logged-in user
config_file="/Users/$currentUser/.config/mreg-cli.conf"

# Check if the file already exists
if [ ! -f "$config_file" ]; then
  # Create the .config directory if it doesn't exist
  mkdir -p "/Users/$currentUser/.config"

  # Populate the config file
  cat &lt;&lt;EOF &gt; "$config_file"
[mreg]
USER=${currentUser}-drift
URL=https://mreg.uio.no
EOF

  echo "Configuration file created at $config_file"
else
  echo "Configuration file already exists."
fi

exit 0
</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%</string> <!-- Dynamically reference downloaded file -->
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/mreg-cli</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>scripts</key>
					<string>scripts</string>
					<key>id</key>
					<string>github.uio.no.mreg-cli</string>
					<key>version</key>
				    <string>%version%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>/usr/local/bin/mreg-cli</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
