<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Emacs for macOS and creates an installer package.</string>
	<key>Identifier</key>
	<string>com.github.gahel.pkg.Emacs</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Emacs</string>
		<key>VENDOR</key>
		<string>Emacs</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gahel.download.Emacs</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
    		<key>Arguments</key>
    		<dict>
        		<key>pkgroot</key>
        		<string>%RECIPE_CACHE_DIR%/pkgroot</string>
    		</dict>
		</dict>
	</array>
</dict>
</plist>
