<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Authy Desktop and imports into munki.</string>
    <key>Identifier</key>
    <string>com.github.gautehel.munki.Authy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Authy Desktop</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Easy to setup 2FA for any account.</string>
            <key>developer</key>
            <string>Twilio</string>
            <key>display_name</key>
            <string>Authy Desktop</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>supported_architectures</key>
            <array>
                <string>arm64</string>
                <string>x86_64</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.4</string>
    <key>ParentRecipe</key>
    <string>com.github.gautehel.download.Authy</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
